{
    "all_resources":
    [
    {
        "category": "Digital Signal Processing Books",
        "description": null,
        "resources": [
            {
                "name": "Discrete-Time Signal Processing",
                "authors": ["Alan Oppenheim", "Ronald Schafer"],
                "type": "book",
                "description": "An incredible reference book covering all the basics of digital signal processing written by professors from MIT. You'll find here an in-depth explanation of concepts like the z-transform, FIR and IIR filters in their various forms, the discrete Fourier transform, and even a handy appendix reviewing the analog filters as a basis for IIR filter design. I do not plan to read it cover-to-cover but I do want to read some sections in full. Spread over 1000 pages, it contains all you need for computer music understanding and more.",
                "image": "https://images-na.ssl-images-amazon.com/images/I/51v48p99JjL._SX404_BO1,204,203,200_.jpg",
                "affiliate_link": "#"
            },
            {
                "name": "Signals and Systems",
                "authors": ["Alan V. Oppenheim", "Alan S. Willsky", "S. Hamid Nawab"],
                "type": "book",
                "description": "Yet another reference book from MIT. It covers a little bit wider area than \"Discrete-Time Signal Processing\" and focuses mostly on continuous-time signals (but not only). The most useful sections for audio programmers include the Fourier series, the Fourier transform, sampling, the Laplace transform, the z-transform, and signal modulation.",
                "image": "https://m.media-amazon.com/images/I/51F6bPQAq9L.jpg",
                "affiliate_link": "#"
            },
            {
                "name": "Introduction to Digital Filters with Audio Applications",
                "authors": ["Julius O. Smith III"],
                "type": "book",
                "description": "A great read to understand the rationale behind the digital filters. It is a relatively short book (less than 300 pages) and is available online for free. As it a book accompanying a university course, it tries to explain things intuitively and show the reader various approaches to understanding filters. It shows the relation between the analog and the digital filters and provides a lot of helpful mathematics that underlie the two.",
                "image": "https://m.media-amazon.com/images/I/31B8qd622aL.jpg",
                "link": "https://ccrma.stanford.edu/~jos/filters/"
            }
        ]
    },
    {
        "category": "Sound Synthesis Books",
        "description": null,
        "resources": [
            {
                "name": "The Computer Music Tutorial",
                "authors": ["Curtis Roads"],
                "type": "book",
                "description": "Although it may seem to be an old book, it explains the basic concepts of sound synthesis incredibly well. If you consider writing software to generate sound, I recommend starting with this book. It covers sampling, additive synthesis, wavetable synthesis, wave terrain synthesis, granular synthesis, subtractive synthesis, all types of modulation synthesis, and touches also on physical modeling, FOF (formant) synthesis, graphic synthesis, and stochastic synthesis. It also does a nice job of providing names of example works using the described techniques. Some additional useful parts deal with the MIDI protocol and digital signal processors' internals. I've read this book almost in full (I skipped the part on algorithmic composition) and I believe anyone can follow the presented material. There are few code listings and the maths used is very basic. For interested readers, the book contains very useful references albeit quite old ones.",
                "image": "https://m.media-amazon.com/images/I/41TySzFBccL.jpg",
                "affiliate_link": "#"
            },
            {
                "name": "Sound Synthesis and Sampling",
                "authors": ["Martin Russ"],
                "type": "book",
                "description": "A description of sound synthesis techniques from a user's perspective. What do all those knobs mean? There is no code and almost no mathematics inside. Nevertheless, the book is incredibly useful for audio programmers. Here you can find, for example, a thorough explanation of envelope types. There is also a little bit more on sampling than in the book by Curtis Roads. The conversational style of the book keeps you engaged throughout. I've read this one in full and I would do it again.",
                "image": "https://m.media-amazon.com/images/I/51F6+V3foOS.jpg",
                "affiliate_link": "#"
            },
            {
                "name": "Sound Synthesis for Music Reproduction and Performance",
                "authors": ["Marek Pluta"],
                "type": "book",
                "description": "This monograph is not widely distributed and I don't know how to get hold of a copy other than by contacting the author directly. This book is a real sound synthesis encyclopedia. It describes all synthesis techniques you could imagine and two novel methods developed by the author himself. As an educated physicist, violinist, and conductor, he definitely knows what he's writing about. I have only used the book for reference so far but I plan to read it in full soon.",
                "link": "https://www.researchgate.net/publication/332258464_Sound_Synthesis_for_Music_Reproduction_and_Performance"
            }
        ]
    },
    {
        "category": "Other Digital Audio Books",
        "description": null,
        "resources": [
            {
                "name": "Digital Audio FX (DAFX)",
                "authors": ["Udo Zölzer"],
                "type": "book",
                "image": "https://m.media-amazon.com/images/I/51YOksxKouL.jpg",
                "description": "An amazing compilation of formulas, schematics, and code listings about all kinds of digital audio effects: from filters in all their flavors, through vibratos, compressors, EQs, to reverberation and time stretching. I plan to read this book in full but I have already read big chunks of it: all laid out in plain, understandable English without unnecessary additions. Additionally, every chapter ends with a comprehensive list of references. If you want to code an audio effect, start with this book. Related to this book, is the <a href=\"https://www.dafx.de\">DAFX conference</a>.",
                "affiliate_link": "#"
            },
            {
                "name": "Digital Audio Signal Processing",
                "authors": ["Udo Zölzer"],
                "type": "book",
                "image": "https://m.media-amazon.com/images/I/41kVZ47HptS.jpg",
                "description": "This book covers the middle ground between DSP handbooks and \"Digital Audio FX\". It covers sampling, quantization, AD/DA conversion, audio systems interfacing, equalizers, reverberation, compressors, resampling, and audio coding. Interestingly, it contains some more in-depth derivations and explanations than DAFX. Check it out if you need some more reasoning behind certain algorithms rather than pure algorithms themselves.",
                "affiliate_link": "#"
            },
            {
                "name": "Physical Audio Signal Processing",
                "authors": ["Julius O. Smith III"],
                "type": "book",
                "description": "A comprehensive and versatile book on physical modeling, including not just sound synthesis but also reverberation and analog audio effects, like filters or phasers. It's a real encyclopedia of computer music... Check it out for sure, since it's free.",
                "image": "https://m.media-amazon.com/images/I/41+gJPhzIfL.jpg",
                "link": "https://ccrma.stanford.edu/~jos/pasp/"
            },
            {
                "name": "Fundamentals of Music Processing",
                "authors": ["Meinard Müller"],
                "type": "book",
                "link": "https://www.audiolabs-erlangen.de/fau/professor/mueller/bookFMP",
                "image": "https://m.media-amazon.com/images/I/41+cqKyxVeL.jpg",
                "description": "Written by a professor from AudioLabs (joint institution of the Fraunhofer IIS and Friedrich-Alexander University of Erlangen-Nürnberg), who is known as an excellent educator, this book lays out most if not all classic (pre-deep learning) algorithms for music analysis (including the basics of Shazam's audio identification algorithm). On the accompanying website, you can find Jupyter Notebooks, sound examples, and exercises, which make the understanding even easier. I have read big portions of this book and I must admit that rarely any book is so clear as to its mathematical notation. With that being said, you won't find here anything of audio effects or sound synthesis; this is pure music signal analysis. Take a look at least at the table of contents, since the book is available online for free (for example, <a href=\"https://www.researchgate.net/publication/288774112_Fundamentals_of_Music_Processing\">from ResearchGate</a>)."
            }
        ]
    },
    {
        "category": "Computer Science Books",
        "description": null,
        "resources": [
            {
                "name": "Design Patterns",
                "type": "book",
                "description": "Book 1 description",
                "image": null,
                "affiliate_link": "#"
            },
            {
                "name": "Clean Code",
                "type": "book",
                "description": "",
                "image": null,
                "affiliate_link": "#"
            },
            {
                "name": "Clean Architecture",
                "type": "book",
                "description": "",
                "image": null,
                "affiliate_link": "#"
            },
            {
                "name": "The C++ Programming Language",
                "type": "book",
                "description": "",
                "image": null,
                "affiliate_link": "#"
            },
            {
                "name": "Pragmatic Programmer",
                "type": "book",
                "description": "",
                "image": null,
                "affiliate_link": "#"
            },
            {
                "name": "Operating Systems by William Stallings",
                "type": "book",
                "description": "",
                "image": null,
                "affiliate_link": "#"
            },
            {
                "name": "Kincaid",
                "type": "book",
                "description": "",
                "image": null,
                "affiliate_link": "#"
            },
            {
                "name": "Introduction to Algorithms",
                "type": "book",
                "description": "",
                "image": null,
                "affiliate_link": "#"
            },
            {
                "name": "Practical Web Development",
                "type": "book",
                "description": "",
                "image": null,
                "affiliate_link": "#"               
            },
            {
                "name": "Deep Learning",
                "type": "book",
                "description": "",
                "image": null,
                "affiliate_link": "#"               
            }
        ]
    },
    {
        "category": "Self-Development Books",
        "description": null,
        "resources": [
            {
                "name": "A Mind for Numbers",
                "type": "book",
                "description": "Book 1 description",
                "image": null,
                "affiliate_link": "#"
            },
            {
                "name": "Deep Work",
                "type": "book",
                "description": "",
                "image": null,
                "affiliate_link": "#"
            },
            {
                "name": "The Power of Habit",
                "type": "book",
                "description": "",
                "image": null,
                "affiliate_link": "#"
            },
            {
                "name": "Atomic Habits",
                "type": "book",
                "description": "",
                "image": null,
                "affiliate_link": "#"
            },
            {
                "name": "Essentialist",
                "type": "book",
                "description": "",
                "image": null,
                "affiliate_link": "#"
            },
            {
                "name": "One Thing",
                "type": "book",
                "description": "",
                "image": null,
                "affiliate_link": "#"
            },
            {
                "name": "The Millionaire Fastlane",
                "type": "book",
                "description": "",
                "image": null,
                "affiliate_link": "#"
            }
        ]
    },
    {
        "category": "Fiction Books",
        "description": null,
        "resources": [
            {
                "name": "Harry Potter",
                "type": "book",
                "description": "Book 1 description",
                "image": null,
                "affiliate_link": "#"
            },
            {
                "name": "Little Nicholas",
                "type": "book",
                "description": "",
                "image": null,
                "affiliate_link": "#"
            },
            {
                "name": "Artemis Fowl",
                "type": "book",
                "description": "",
                "image": null,
                "affiliate_link": "#"
            },
            {
                "name": "Dune",
                "type": "book",
                "description": "",
                "image": null,
                "affiliate_link": "#"
            },
            {
                "name": "Solaris",
                "type": "book",
                "description": "",
                "image": null,
                "affiliate_link": "#"
            },
            {
                "name": "The Song of Ice and Fire",
                "type": "book",
                "description": "",
                "image": null,
                "affiliate_link": "#"
            }
        ]
    }
    ]
}